MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAA176/mcu.h
extern volatile __GLCDCLUT117bits_t GLCDCLUT117bits __asm__ ("GLCDCLUT117") __attribute__((section("sfrs"), address(0xBF8EA5D4)));
#define GLCDCLUT118 GLCDCLUT118
extern volatile uint32_t   GLCDCLUT118 __attribute__((section("sfrs"), address(0xBF8EA5D8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT118bits_t;
extern volatile __GLCDCLUT118bits_t GLCDCLUT118bits __asm__ ("GLCDCLUT118") __attribute__((section("sfrs"), address(0xBF8EA5D8)));
#define GLCDCLUT119 GLCDCLUT119
extern volatile uint32_t   GLCDCLUT119 __attribute__((section("sfrs"), address(0xBF8EA5DC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT119bits_t;
extern volatile __GLCDCLUT119bits_t GLCDCLUT119bits __asm__ ("GLCDCLUT119") __attribute__((section("sfrs"), address(0xBF8EA5DC)));
#define GLCDCLUT120 GLCDCLUT120
extern volatile uint32_t   GLCDCLUT120 __attribute__((section("sfrs"), address(0xBF8EA5E0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT120bits_t;
extern volatile __GLCDCLUT120bits_t GLCDCLUT120bits __asm__ ("GLCDCLUT120") __attribute__((section("sfrs"), address(0xBF8EA5E0)));
#define GLCDCLUT121 GLCDCLUT121
extern volatile uint32_t   GLCDCLUT121 __attribute__((section("sfrs"), address(0xBF8EA5E4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT121bits_t;
extern volatile __GLCDCLUT121bits_t GLCDCLUT121bits __asm__ ("GLCDCLUT121") __attribute__((section("sfrs"), address(0xBF8EA5E4)));
#define GLCDCLUT122 GLCDCLUT122
extern volatile uint32_t   GLCDCLUT122 __attribute__((section("sfrs"), address(0xBF8EA5E8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT122bits_t;
extern volatile __GLCDCLUT122bits_t GLCDCLUT122bits __asm__ ("GLCDCLUT122") __attribute__((section("sfrs"), address(0xBF8EA5E8)));
#define GLCDCLUT123 GLCDCLUT123
extern volatile uint32_t   GLCDCLUT123 __attribute__((section("sfrs"), address(0xBF8EA5EC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT123bits_t;
extern volatile __GLCDCLUT123bits_t GLCDCLUT123bits __asm__ ("GLCDCLUT123") __attribute__((section("sfrs"), address(0xBF8EA5EC)));
#define GLCDCLUT124 GLCDCLUT124
extern volatile uint32_t   GLCDCLUT124 __attribute__((section("sfrs"), address(0xBF8EA5F0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT124bits_t;
extern volatile __GLCDCLUT124bits_t GLCDCLUT124bits __asm__ ("GLCDCLUT124") __attribute__((section("sfrs"), address(0xBF8EA5F0)));
#define GLCDCLUT125 GLCDCLUT125
extern volatile uint32_t   GLCDCLUT125 __attribute__((section("sfrs"), address(0xBF8EA5F4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT125bits_t;
extern volatile __GLCDCLUT125bits_t GLCDCLUT125bits __asm__ ("GLCDCLUT125") __attribute__((section("sfrs"), address(0xBF8EA5F4)));
#define GLCDCLUT126 GLCDCLUT126
extern volatile uint32_t   GLCDCLUT126 __attribute__((section("sfrs"), address(0xBF8EA5F8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT126bits_t;
extern volatile __GLCDCLUT126bits_t GLCDCLUT126bits __asm__ ("GLCDCLUT126") __attribute__((section("sfrs"), address(0xBF8EA5F8)));
#define GLCDCLUT127 GLCDCLUT127
extern volatile uint32_t   GLCDCLUT127 __attribute__((section("sfrs"), address(0xBF8EA5FC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT127bits_t;
extern volatile __GLCDCLUT127bits_t GLCDCLUT127bits __asm__ ("GLCDCLUT127") __attribute__((section("sfrs"), address(0xBF8EA5FC)));
#define GLCDCLUT128 GLCDCLUT128
extern volatile uint32_t   GLCDCLUT128 __attribute__((section("sfrs"), address(0xBF8EA600)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT128bits_t;
extern volatile __GLCDCLUT128bits_t GLCDCLUT128bits __asm__ ("GLCDCLUT128") __attribute__((section("sfrs"), address(0xBF8EA600)));
#define GLCDCLUT129 GLCDCLUT129
extern volatile uint32_t   GLCDCLUT129 __attribute__((section("sfrs"), address(0xBF8EA604)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT129bits_t;
extern volatile __GLCDCLUT129bits_t GLCDCLUT129bits __asm__ ("GLCDCLUT129") __attribute__((section("sfrs"), address(0xBF8EA604)));
#define GLCDCLUT130 GLCDCLUT130
extern volatile uint32_t   GLCDCLUT130 __attribute__((section("sfrs"), address(0xBF8EA608)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT130bits_t;
extern volatile __GLCDCLUT130bits_t GLCDCLUT130bits __asm__ ("GLCDCLUT130") __attribute__((section("sfrs"), address(0xBF8EA608)));
#define GLCDCLUT131 GLCDCLUT131
extern volatile uint32_t   GLCDCLUT131 __attribute__((section("sfrs"), address(0xBF8EA60C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT131bits_t;
extern volatile __GLCDCLUT131bits_t GLCDCLUT131bits __asm__ ("GLCDCLUT131") __attribute__((section("sfrs"), address(0xBF8EA60C)));
#define GLCDCLUT132 GLCDCLUT132
extern volatile uint32_t   GLCDCLUT132 __attribute__((section("sfrs"), address(0xBF8EA610)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT132bits_t;
extern volatile __GLCDCLUT132bits_t GLCDCLUT132bits __asm__ ("GLCDCLUT132") __attribute__((section("sfrs"), address(0xBF8EA610)));
#define GLCDCLUT133 GLCDCLUT133
extern volatile uint32_t   GLCDCLUT133 __attribute__((section("sfrs"), address(0xBF8EA614)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT133bits_t;
extern volatile __GLCDCLUT133bits_t GLCDCLUT133bits __asm__ ("GLCDCLUT133") __attribute__((section("sfrs"), address(0xBF8EA614)));
#define GLCDCLUT134 GLCDCLUT134
extern volatile uint32_t   GLCDCLUT134 __attribute__((section("sfrs"), address(0xBF8EA618)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT134bits_t;
extern volatile __GLCDCLUT134bits_t GLCDCLUT134bits __asm__ ("GLCDCLUT134") __attribute__((section("sfrs"), address(0xBF8EA618)));
#define GLCDCLUT135 GLCDCLUT135
extern volatile uint32_t   GLCDCLUT135 __attribute__((section("sfrs"), address(0xBF8EA61C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT135bits_t;
extern volatile __GLCDCLUT135bits_t GLCDCLUT135bits __asm__ ("GLCDCLUT135") __attribute__((section("sfrs"), address(0xBF8EA61C)));
#define GLCDCLUT136 GLCDCLUT136
extern volatile uint32_t   GLCDCLUT136 __attribute__((section("sfrs"), address(0xBF8EA620)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT136bits_t;
extern volatile __GLCDCLUT136bits_t GLCDCLUT136bits __asm__ ("GLCDCLUT136") __attribute__((section("sfrs"), address(0xBF8EA620)));
#define GLCDCLUT137 GLCDCLUT137
extern volatile uint32_t   GLCDCLUT137 __attribute__((section("sfrs"), address(0xBF8EA624)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT137bits_t;
extern volatile __GLCDCLUT137bits_t GLCDCLUT137bits __asm__ ("GLCDCLUT137") __attribute__((section("sfrs"), address(0xBF8EA624)));
#define GLCDCLUT138 GLCDCLUT138
extern volatile uint32_t   GLCDCLUT138 __attribute__((section("sfrs"), address(0xBF8EA628)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT138bits_t;
